; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	infrared0 - mode
	infrared2 - mode
	thermograph1 - mode
	spectrograph3 - mode
	thermograph4 - mode
	GroundStation2 - direction
	GroundStation1 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star3)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph4)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph4)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon4)
	(supports instrument7 spectrograph3)
	(supports instrument7 thermograph1)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon12)
	(supports instrument8 thermograph4)
	(calibration_target instrument8 Star3)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon11)
)
(:goal (and
	(pointing satellite2 Star13)
	(pointing satellite3 GroundStation1)
	(pointing satellite4 Phenomenon12)
	(have_image Phenomenon4 thermograph1)
	(have_image Phenomenon5 thermograph4)
	(have_image Phenomenon6 thermograph4)
	(have_image Phenomenon7 thermograph4)
	(have_image Star8 infrared2)
	(have_image Star9 infrared2)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 infrared0)
	(have_image Star13 infrared0)
	(have_image Star14 infrared2)
	(have_image Planet15 infrared0)
	(have_image Phenomenon16 infrared2)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 15
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 15
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 15
4. (turn_to satellite4 phenomenon12 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 15
5. (turn_to satellite4 star3 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 star3)
   goals met: 0 of 15
6. (calibrate satellite4 instrument8 star3)
   added: (calibrated instrument8)
   goals met: 0 of 15
7. (turn_to satellite4 phenomenon12 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 15
8. (turn_to satellite3 groundstation1 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 groundstation1)
   goals met: 2 of 15
9. (turn_to satellite2 groundstation2 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 groundstation2)
   goals met: 2 of 15
10. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 2 of 15
11. (turn_to satellite2 phenomenon11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 15
12. (take_image satellite2 phenomenon11 instrument4 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 3 of 15
13. (turn_to satellite2 phenomenon4 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon4)
   goals met: 3 of 15
14. (take_image satellite2 phenomenon4 instrument4 thermograph1)
   added: (have_image phenomenon4 thermograph1)
   goals met: 4 of 15
15. (turn_to satellite2 phenomenon5 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 phenomenon5)
   goals met: 4 of 15
16. (take_image satellite2 phenomenon5 instrument4 thermograph4)
   added: (have_image phenomenon5 thermograph4)
   goals met: 5 of 15
17. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   goals met: 5 of 15
18. (take_image satellite2 phenomenon6 instrument4 thermograph4)
   added: (have_image phenomenon6 thermograph4)
   goals met: 6 of 15
19. (turn_to satellite2 phenomenon7 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon7)
   goals met: 6 of 15
20. (take_image satellite2 phenomenon7 instrument4 thermograph4)
   added: (have_image phenomenon7 thermograph4)
   goals met: 7 of 15
21. (turn_to satellite2 star13 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star13)
   goals met: 8 of 15
22. (turn_to satellite0 phenomenon12 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon12)
   goals met: 8 of 15
23. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 8 of 15
24. (turn_to satellite0 star3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star3)
   goals met: 8 of 15
25. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 8 of 15
26. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 8 of 15
27. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 8 of 15
28. (turn_to satellite0 phenomenon12 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon12)
   goals met: 8 of 15
29. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 8 of 15
30. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 8 of 15
31. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 8 of 15
32. (take_image satellite0 phenomenon12 instrument0 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 9 of 15
33. (turn_to satellite0 phenomenon16 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon16)
   goals met: 9 of 15
34. (turn_to satellite0 planet15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet15)
   goals met: 9 of 15
35. (take_image satellite0 planet15 instrument0 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 10 of 15
36. (turn_to satellite0 phenomenon16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon16)
   goals met: 10 of 15
37. (turn_to satellite0 star13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star13)
   goals met: 10 of 15
38. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 11 of 15
39. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 11 of 15
40. (turn_to satellite0 phenomenon16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon16)
   goals met: 11 of 15
41. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 11 of 15
42. (turn_to satellite0 star3 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star3)
   goals met: 11 of 15
43. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 11 of 15
44. (turn_to satellite0 phenomenon16 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon16)
   goals met: 11 of 15
45. (take_image satellite0 phenomenon16 instrument1 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 12 of 15
46. (turn_to satellite0 star14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star14)
   goals met: 12 of 15
47. (take_image satellite0 star14 instrument1 infrared2)
   added: (have_image star14 infrared2)
   goals met: 13 of 15
48. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 13 of 15
49. (take_image satellite0 star8 instrument1 infrared2)
   added: (have_image star8 infrared2)
   goals met: 14 of 15
50. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 14 of 15
51. (take_image satellite0 star9 instrument1 infrared2)
   added: (have_image star9 infrared2)
   goals met: 15 of 15
